In [1]:
import pandas

In [2]:
df = pandas.read_csv('gapminder.tsv.txt', sep='\t')

In [3]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [4]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [5]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [7]:
df.values

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.332, 9240934, 820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.10071],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499603],
       ['Zimbabwe', 'Africa', 2002, 39.989, 11926563, 672.0386227],
       ['Zimbabwe', 'Africa', 2007, 43.487, 12311143, 469.7092981]],
      dtype=object)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.shape

(1704, 6)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [12]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [13]:
country=df['country']

In [14]:
type(country)

pandas.core.series.Series

In [16]:
subset=df[['country','continent','year']]

In [17]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [18]:
pandas.__version__

'1.2.0'

In [19]:
df.loc[2]

country      Afghanistan
continent           Asia
year                1962
lifeExp         31.99700
pop             10267083
gdpPercap      853.10071
Name: 2, dtype: object

In [20]:
df.loc[50]

country        Argentina
continent       Americas
year                1962
lifeExp        65.142000
pop             21283783
gdpPercap    7133.166023
Name: 50, dtype: object

In [23]:
df.loc[[67,0]]

        country continent  year  lifeExp       pop     gdpPercap
67    Australia   Oceania  1987   76.320  16257249  21888.889030
0   Afghanistan      Asia  1952   28.801   8425333    779.445314

In [24]:
df.iloc[2]

country      Afghanistan
continent           Asia
year                1962
lifeExp         31.99700
pop             10267083
gdpPercap      853.10071
Name: 2, dtype: object

In [26]:
subset = df.loc[:,['year','pop']]

In [27]:
subset.head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [ ]:
df.loc[df['year'] == 1967, ['year', 'pop']]

In [32]:
df.loc[df['year'] == 2007, ['country','year', 'pop']]

                 country  year       pop
11           Afghanistan  2007  31889923
23               Albania  2007   3600523
35               Algeria  2007  33333216
47                Angola  2007  12420476
59             Argentina  2007  40301927
...                  ...   ...       ...
1655             Vietnam  2007  85262356
1667  West Bank and Gaza  2007   4018332
1679         Yemen, Rep.  2007  22211743
1691              Zambia  2007  11746035
1703            Zimbabwe  2007  12311143

[142 rows x 3 columns]

In [33]:
df.loc[df['year'] == 2007, ['country','year', 'pop']]

                 country  year       pop
11           Afghanistan  2007  31889923
23               Albania  2007   3600523
35               Algeria  2007  33333216
47                Angola  2007  12420476
59             Argentina  2007  40301927
...                  ...   ...       ...
1655             Vietnam  2007  85262356
1667  West Bank and Gaza  2007   4018332
1679         Yemen, Rep.  2007  22211743
1691              Zambia  2007  11746035
1703            Zimbabwe  2007  12311143

[142 rows x 3 columns]

In [36]:
df.loc[(df['year']==2007)& (df['pop']>100_000_000),['country','year','pop']]

            country  year         pop
107      Bangladesh  2007   150448339
179          Brazil  2007   190010647
299           China  2007  1318683096
707           India  2007  1110396331
719       Indonesia  2007   223547000
803           Japan  2007   127467972
995          Mexico  2007   108700891
1139        Nigeria  2007   135031164
1175       Pakistan  2007   169270617
1619  United States  2007   301139947